Indeed, it was due to missing "Snippets" content type on the storage.

I've added a better diagnostic for this use case:

```
rraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.test_file will be created
  + resource "proxmox_virtual_environment_file" "test_file" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve"

      + source_file {
          + changed   = false
          + file_name = "main.tf-copy-as-snippet.txt"
          + insecure  = false
          + path      = "main.tf"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
proxmox_virtual_environment_file.test_file: Creating...
╷
│ Warning: the datastore "local" does not support content type "snippets"
│
│   with proxmox_virtual_environment_file.test_file,
│   on main.tf line 1, in resource "proxmox_virtual_environment_file" "test_file":
│    1: resource "proxmox_virtual_environment_file" "test_file" {
│
╵
╷
│ Error: failed to read file from "local:snippets/main.tf-copy-as-snippet.txt"
│
│   with proxmox_virtual_environment_file.test_file,
│   on main.tf line 1, in resource "proxmox_virtual_environment_file" "test_file":
│    1: resource "proxmox_virtual_environment_file" "test_file" {
│
╵
```